Autodesk.Revit.DB.Electrical.ConduitSize.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ConduitSize.UsedInSizing
Whether is used in sizing.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSize.UsedInSizeLists
Whether it is used in size lists.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSize.BendRadius
Minimum bend radius
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSize.OuterDiameter
Outer diameter
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSize.InnerDiameter
Inner diameter
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSize.NominalDiameter
Nominal diameter
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSize.#ctor(System.Double,System.Double,System.Double,System.Double,System.Boolean,System.Boolean)
Constructs an object that stores the basic size information for conduit.
nominalDiameter:
Nominal diameter. The value should be a valid, positive Revit length.
innerDiameter:
Inner diameter. The value should be a valid, positive Revit length.
outerDiameter:
Outer diameter. The value should be a valid, positive Revit length.
bendRadius:
Minimum bend radius. The value should be a valid, positive Revit length.
usedInSizeLists:
Whether it is used in size lists.
usedInSizing:
Whether is used in sizing.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for nominalDiameter must be greater than 0 and no more than 30000 feet.
-or-
The given value for innerDiameter must be greater than 0 and no more than 30000 feet.
-or-
The given value for outerDiameter must be greater than 0 and no more than 30000 feet.
-or-
The given value for bendRadius must be greater than 0 and no more than 30000 feet.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSize
Stores the basic size information for a conduit.
Since:
2017